console.log(Ваша оценка - 100 баллов 
  Отзыв по пунктам ТЗ:
  Выполненные пункты:
   блок header 
   блок Not only 
   блок About 
   блок Our Friends 
   блок Help 
   блок In addition 
   блок footer 
   блок header 
   блок Not only 
   блок About 
   блок Our Friends 
   блок Help 
   блок In addition 
   блок footer 
   блок header 
   блок Not only 
   блок About 
  
  блок Our Friends 
  
  блок Help 
  
  блок In addition
  
  блок footer 
  
  блок header 
  
  блок Our Friends 
  
  блок footer 
  
  блок header 
  
  блок Our Friends 
  
  блок footer 
  
  блок header
  
  блок Our Friends 
  
  блок footer 
  
  нет полосы прокрутки при ширине страницы Main от 1280рх до 768рх 
  
  нет полосы прокрутки при ширине страницы Main от 768рх до 320рх 
  
  нет полосы прокрутки при ширине страницы Pets от 1280рх до 768рх  
  
  нет полосы прокрутки при ширине страницы Pets от 768рх до 320рх 
  
  на странице Main, при плавном изменении размера экрана от 1280px до 320px верстка подстраивается под этот размер, элементы верстки меняют свои размеры и расположение, не наезжают друг на друга, изображения могут менять размер, но сохраняют правильные пропорции 
  
  на странице Pets, при плавном изменении размера экрана от 1280px до 320px верстка подстраивается под этот размер, элементы верстки меняют свои размеры и расположение, не наезжают друг на друга, изображения могут менять размер, но сохраняют правильные пропорции 
  
  При ширине экрана меньше 768px на обеих страницах меню в хедере скрывается, появляется иконка бургер-меню. Открытие меню при клике на иконку бургер-меню на текущем этапе не проверяется 
  
  Верстка обеих страниц валидная: для проверки валидности вёрстки используйте сервис https://validator.w3.org/  
  
  )